config/doom2/config.org
#+TITLE: My emacs configuration
#+AUTHOR:  Lucas Elvira Martín
* Table of content :TOC:
  - [[#key-binding-for-dired][Key binding for dired]]
  - [[#configure-dired][Configure DIRED]]
- [[#ui][UI]]
  - [[#fonts][Fonts]]
- [[#development][Development]]
  - [[#projectile][Projectile]]
  - [[#magit][Magit]]
  - [[#git-gutter][Git gutter]]
  - [[#rainbown][Rainbown]]
- [[#completion-system][Completion system]]
  - [[#ivy][IVY]]
- [[#writing][Writing]]
  - [[#configure-flyspell][Configure flyspell]]
  - [[#text-mode][Text mode]]
- [[#org-mode][Org mode]]
  - [[#configure-org-agenda][Configure org-agenda]]
  - [[#configure-templates][Configure templates]]
  - [[#org-auto-tangle][Org auto-tangle]]
  - [[#org-export][Org export]]
- [[#org-roam][Org roam]]
  - [[#key-binding][Key binding]]
  - [[#capture-templates][Capture templates]]
  - [[#org-roam-ui][Org roam UI]]
  - [[#zettelkasten-methodology][Zettelkasten methodology]]
  -  [[#3-permanent-notes][3. Permanent notes]]
  -  [[#4-index-notes][4. Index Notes]]

** Key binding for dired

| COMMAND    | Description                    | Key binding |
|------------+--------------------------------+-------------|
| dired      | Open dired                     | SPC d d     |
| dired-Jump | Jumpt to the current directory | SPC d j     |

*** Key binding within dired

| COMMAND                | DESCRIPTION                                 | KEYBINDING |
|------------------------+---------------------------------------------+------------|
| dired-view-file        | View file in dired                          | SPC d v    |
| dired-up-directory     | Go up in directory tree                     | h          |
| dired-find-file        | Go down in directory tree (or open if file) | l          |
| dired-next-line        | Move down to next line                      | j          |
| dired-previous-line    | Move up to previous line                    | k          |
| dired-mark             | Mark file at point                          | m          |
| dired-unmark           | Unmark file at point                        | u          |
| dired-do-copy          | Copy current file or marked files           | C          |
| dired-do-rename        | Rename current file or marked files         | R          |
| dired-hide-details     | Toggle detailed listings onoff              | (          |
| dired-git-info-mode    | Toggle git information onoff                | )          |
| dired-create-directory | Create new empty directory                  | +          |
| dired-diff             | Compare file at point with another          | =          |
| dired-subtree-toggle   | Toggle viewing subtree at point             | TAB        |

*** Dired commands using regex


| COMMAND                 | DESCRIPTION                | KEYBINDING |
|-------------------------+----------------------------+------------|
| dired-mark-files-regexp | Mark files using regex     | % m        |
| dired-do-copy-regexp    | Copy files using regex     | % C        |
| dired-do-rename-regexp  | Rename files using regex   | % R        |
| dired-mark-files-regexp | Mark all files using regex | * %        |

*** File permission and ownership
| COMMAND         | DESCRIPTION                      | KEYBINDING |
|-----------------+----------------------------------+------------|
| dired-do-chgrp  | Change the group of marked files | g G        |
| dired-do-chmod  | Change the mode of marked files  | M          |
| dired-do-chown  | Change the owner of marked files | O          |
| dired-do-rename | Rename file or all marked files  | R          |


*** Define the configuration

#+begin_src emacs-lisp
(map! :leader
      (:prefix ("d" . "dired")
       :desc "Open dired" "d" #'dired
       :desc "Dired jump to current" "j" #'dired-jump)
      (:after dired
       (:map dired-mode-map
        :desc "Peep-dired image previews" "d p" #'peep-dired
        :desc "Dired view file"           "d v" #'dired-view-file)))
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-single-buffer ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "Z") 'dired-do-compress
  (kbd "+") 'dired-create-directory
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt
  (kbd "y") 'dired-ranger-copy
  (kbd "p") 'dired-ranger-paste
  (kbd "d") 'dired-ranger-move)
#+end_src




** Configure DIRED

#+begin_src emacs-lisp
(setq dired-listing-swithces "--group-directories-first"
      delete-by-moving-to-trash t
      dired-open-extensions '(("gif" . "eog")
                              ("jpg" . "eog")
                              ("png" . "eog")
                              ("mkv" . "mpv")
                              ("mp4" . "mpv")
                              ("pdf" . "evince")))
#+end_src



* UI

** Fonts
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that is used for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.
+ 'font-lock-comment-face' -- for comments.
+ 'font-lock-keyword-face' -- for keywords with special significance like 'setq' in elisp.

#+BEGIN_SRC emacs-lisp
(setq doom-font (font-spec :family "Fira Code" :size 15)
      doom-variable-pitch-font (font-spec :family "Noto Sans" :size 15)
      doom-big-font (font-spec :family "Fira Code" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+END_SRC


* Development

** Projectile

Still empty because I don't know if I will need config it


*** counsel-projectile

*** Key binding for projectile

** Magit
#+begin_src emacs-lisp
;;(after! magit
;;(magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** Git gutter

Git gutter is a software which make easy to view the difference between a file
and the last commit from the same file

#+begin_src emacs-lisp
#+end_src


** Rainbown
Rainbox mode displays the actual color for any hex value color.  It’s such a nice feature that I wanted it turned on all the time, regardless of what mode I am in.  The following creates a global minor mode for rainbow-mode and enables it (exception: org-agenda-mode since rainbow-mode destroys all highlighting in org-agenda).

#+begin_src emacs-lisp
(define-globalized-minor-mode global-rainbow-mode rainbow-mode
  (lambda ()
    (when (not (memq major-mode
                (list 'org-agenda-mode)))
     (rainbow-mode 1))))
(global-rainbow-mode 1 )
#+end_src
* Completion system
** IVY

#+begin_src emacs-lisp
(after! ivy
(setq ivy-posframe-display-functions-alist
      '((swiper                     . ivy-posframe-display-at-point)
        (complete-symbol            . ivy-posframe-display-at-point)
        (counsel-M-x                . ivy-display-function-fallback)
        (counsel-esh-history        . ivy-posframe-display-at-window-center)
        (counsel-describe-function  . ivy-display-function-fallback)
        (counsel-describe-variable  . ivy-display-function-fallback)
        (counsel-find-file          . ivy-display-function-fallback)
        (counsel-recentf            . ivy-display-function-fallback)
        (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
        (dmenu                      . ivy-posframe-display-at-frame-top-center)
        (nil                        . ivy-posframe-display))
      ivy-posframe-height-alist
      '((swiper . 20)
        (dmenu . 20)
        (t . 10)))
)

(use-package! ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+end_src

* Writing

** Configure flyspell

#+begin_src emacs-lisp :tangle yes
(defun lem/switch-dictionary()
  (interactive)
  (let* ((dic ispell-current-dictionary)
     (change (if (string= dic "en_US") "es_ES" "en_US")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)
    ))

  (global-set-key (kbd "<f8>")   'lem/switch-dictionary)

#+end_src

** Text mode


#+begin_src emacs-lisp
  (defun lem/text-mode-setup ()
    "test hook"
    (variable-pitch-mode 1)
    (auto-fill-mode 1)
    ;(visual-line-mode 1)
    (visual-fill-column-mode 1)
    (setq evil-auto-indent nil))

  (add-hook 'tex-mode-hook 'lem/text-mode-setup)
#+end_src

**** Latex

Latex is a markup language bast used to write text without warning about the
format. One very important advantage of this language is that you could define
the style after write  the text and the resulting PDF will be the same,
independent the OS you are using. This not happen when you work with visual
editors.

