config/doom2/config.el

(setq org-preview-latex-default-process 'dvisvgm)
  (setq org-preview-latex-process-alist
	  '((dvipng :programs
		    ("latex" "dvipng")
		    :description "dvi > png" :message "you need to install the programs: latex and dvipng." :image-input-type "dvi" :image-output-type "png" :image-size-adjust
		    (1.0 . 1.0)
		    :latex-compiler
		    ("latex -interaction nonstopmode -output-directory %o %f")
		    :image-converter
		    ("dvipng -D %D -T tight -bg Transparent -o %O %f"))
	    (dvisvgm :programs
		     ("latex" "dvisvgm")
		     :description "dvi > svg" :message "you need to install the programs: latex and dvisvgm." :image-input-type "dvi" :image-output-type "svg" :image-size-adjust
		     (1.7 . 1.5)
		     :latex-compiler
		     ("latex -interaction nonstopmode -output-directory %o %f")
		     :image-converter
		     ("dvisvgm %f -e -n -b min -c %S -o %O"))
	    (imagemagick :programs
			 ("latex" "convert")
			 :description "pdf > png" :message "you need to install the programs: latex and imagemagick." :image-input-type "pdf" :image-output-type "png" :image-size-adjust
			 (1.0 . 1.0)
			 :latex-compiler
		 ("pdflatex -interaction nonstopmode -output-directory %o %f")
			 :image-converter
			 ("convert -density %D -trim -antialias %f -quality 100 %O"))))

(custom-set-faces
 '(markdown-header-face ((t (:inherit font-lock-function-name-face :weight bold :family "variable-pitch"))))
 '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.7))))
 '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.6))))
 '(markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.5))))
 '(markdown-header-face-4 ((t (:inherit markdown-header-face :height 1.4))))
 '(markdown-header-face-5 ((t (:inherit markdown-header-face :height 1.3))))
 '(markdown-header-face-6 ((t (:inherit markdown-header-face :height 1.2)))))

(map! :leader
      :desc "Org babel tangle" "m B" #'org-babel-tangle)
(defun lem/org-mode-setup ()
  (org-indent-mode))

(after! org
(setq
      org-directory "~/Documents/Org"
      org-default-notes-file (expand-file-name "Inbox.org" org-directory)
      org-ellipsis " ▾"
      org-superstar-headline-bullets-list '("◉" "●" "○" "◆" "●" "○" "◆")
      org-log-done 'time
      org-hide-emphasis-markers nil
      org-src-fontify-natively t
      org-fontify-quote-and-verse-blocks t
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 2
      org-hide-block-startup nil
      org-src-preserve-indentation nil
      org-cycle-separator-lines 2
      org-todo-keywords '((sequence
                           "TODO(t)" "NEXT(n)" "WAIT(w)" "|"
                           "DONE(d!)" "CANCELED(c)"))
      org-tag-alist
      '((:startgroup . nil)
        ;; Put mutually exclusive tags here
        ("@home" . ?H )
        ("@PHD" . ?P)
        ("@UI" . ?U)
        (:endgroup . nil))
      org-refile-targets '((nil :maxlevel . 2)
                           (org-agenda-files :maxlevel . 1))
      org-outline-path-complete-in-steps nil
      org-refile-use-outline-path    t
      user-full-name "Lucas Elvira Martín"
      user-mail-address "lucaselvira96@gmail.com"))

(setq org-agenda-files (mapcar (lambda (file) (concat org-directory file)) '("Tasks.org" "Habits.org")))

(setq org-agenda-window-setup 'current-window)
(setq org-agenda-span 'week)
(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)

; custom display of task
(setq org-columns-default-format "%20CATEGORY(Category) %30ITEM(Task) %4TODO %6Effort(Estim){:} %16SCHEDULED %6CLOCKSUM(Clock) %TAGS")

(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)

(setq org-capture-templates
      `(("t" "Tasks / Projects")
        ("tl" "Task with link" entry (file+olp+datetree ,(concat org-directory "Tasks.org"))
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
        ("tt" "Task" entry (file+olp+datetree ,(concat org-directory "Tasks.org"))
         "* TODO %?\n  %U\n  %i"
         :tree-type week
         :empty-lines 1)
      ("j" "Journal Entries")
      ("je" "Journal" entry
        (file+olp+datetree ,(concat org-directory "Journal.org"))
        "\n* %<%I:%M %p> - %^{Title} \n\n%?\n\n"
        :tree-type week
        :clock-in :clock-resume
        :empty-lines 1)
      ("jt" "Task Entry" entry
       (file+olp+datetree ,(concat org-directory "Journal.org"))
       "\n* %<%I:%M %p> - Task Notes: %a\n\n%?\n\n"
       :tree-type week
       :clock-in :clock-resume
       :empty-lines 1)
      ("jm" "Meeting" entry
       (file+olp+datetree ,(concat org-directory "Journal.org"))
       "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
       :clock-in :clock-resume
       :empty-lines 1)
      ("jj" "Journal" entry
       (file+olp+datetree ,(concat org-directory "Journal.org"))
       "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
       :tree-type week
       :clock-in :clock-resume
       :empty-lines 1)))

(dolist (face '((org-level-1 . 1.4)
                (org-level-2 . 1.3)
                (org-level-3 . 1.2)
                (org-level-4 . 1.1)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil  :weight 'medium :height (cdr face)))

;; This is needed as of Org 9.2
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("js" . "src python"))
(add-to-list 'org-structure-template-alist '("ex" . "export"))

(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default nil))

(after! ox-latex

  ;; update the list of LaTeX classes and associated header (encoding, etc.)
  ;; and structure
  '(add-to-list 'org-latex-classes
                `("beamer"
                  ,(concat "\\documentclass[presentation]{beamer}\n"
                           "[DEFAULT-PACKAGES]"
                           "[PACKAGES]"
                           "[EXTRA]\n")
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
(setq org-latex-listings t)

(defun lem/sync (path)
    (shell-command-to-string (format "/home/lucas/.local/bin/sync.sh %s" path)))

  (defun lem/sync-org ()
  "Sync the Org foler with an external script"
  (interactive)
  (lem/sync "~/Documents/Org"))

  (defun lem/sync-conf ()
  "Sync the config foler with an external script"
(interactive)
(lem/sync "~/Documents/git/dotfiles"))

  ;; (add-hook 'after-save-hook 'lem/sync) Use as hook generate a lot of commits

(after! org
  (setq org-roam-directory (file-truename "~/Documents/Org/roam")
))

(map! :leader
      (:prefix ("n r" . "org-roam")
       :desc "Completion at point" "c" #'completion-at-point
       :desc "Find node"           "f" #'org-roam-node-find
       :desc "Show graph"          "g" #'org-roam-graph
       :desc "Insert node"         "i" #'org-roam-node-insert
       :desc "Capture to node"     "n" #'org-roam-capture
       :desc "Toggle roam buffer"  "r" #'org-roam-buffer-toggle))
