config/doom2/config.org
** Capture templates

#+begin_src emacs-lisp
  (setq org-roam-capture-templates
        '(("d" "default" plain "%?"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n#+author: %n\n")
           :unnarrowed t)
          ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
           :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
  :unnarrowed t)
          ))


#+end_src

** Org roam UI

#+begin_src emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
    :after org-roam ;; or :after org
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start t))
#+end_src

*** Org Habits

#+begin_src emacs-lisp
 (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
#+end_src

*** Org pomodoro

#+begin_src emacs-lisp
  (use-package! org-pomodoro
    :after org
    :commands (org-pomodoro)
    :config
    (setq
   alert-user-configuration (quote ((((:category . "org-pomodoro")) libnotify nil)))
   org-pomodoro-length 120
   org-pomodoro-short-break-length 10))
#+end_src
*** Org roam configuration hacks


#+begin_src emacs-lisp
      (defun my/org-roam-filter-by-tag (tag-name)
        (lambda (node)
          (member tag-name (org-roam-node-tags node))))


      (defun my/org-roam-list-notes-by-tag (tag-name)
          (mapcar #'org-roam-node-file
                  (seq-filter
                   (my/org-roam-filter-by-tag tag-name)
                   (org-roam-node-list))))

      (defun my/org-roam-refresh-agenda-list ()
              (interactive)
              (setq org-agenda-files (delete-dups (append org-agenda-files (my/org-roam-list-notes-by-tag "Project")))))

              ;; Build the agenda list the first time for the session

            (defun my/org-roam-project-finalize-hook ()
                "Adds the captured project file to `org-agenda-files' if the
              capture was not aborted."
                ;; Remove the hook since it was added temporarily
                (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

                ;; Add project file to the agenda list if the capture was confirmed
                (unless org-note-abort
                  (with-current-buffer (org-capture-get :buffer)
                    (add-to-list 'org-agenda-files (buffer-file-name)))))

          (defun my/org-roam-find-project ()
              (interactive)
              ;; Add the project file to the agenda after capture is finished
              (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

            ;; Select a project file to open, creating it if necessary
              (org-roam-node-find
             nil
             nil
             (lambda (node)
              (member "Project" (org-roam-node-tags node)))))

      (defun my/org-roam-capture-inbox ()
        (interactive)
        (org-roam-capture- :node (org-roam-node-create)
                           :templates '(("i" "inbox" plain "* %?"
                                         :if-new (file+head "Inbox.org" "#+title: Inbox\n")))))
    (defun my/org-roam-capture-task ()
      (interactive)
      ;; Capture the new task, creating the project file if necessary
      (org-roam-capture- :node (org-roam-node-read
                                nil
                                (my/org-roam-filter-by-tag "Project"))
                         :templates '(
                                      ("p" "project" plain "** TODO %?"
                                       :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                              "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                              ("Tasks")))
                                      ("s" "start now" entry "** TODO %?"
                                       :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                              "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                              ("Tasks"))
                                       :clock-in :clock-resume)
                                      )))

    (defun lem/org-roam-capture-meeting ()
      (interactive)
      (org-roam-capture- :node (org-roam-node-read
                               nil
                               (my/org-roam-filter-by-tag "Project"))
                         :templates '(("m" "Meeting" plain "** %<%Y-%m-%d %H:%M>\n%?"
                                       :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                                  "#+title: ${title}\n#+category:${title}\n#+filetags: Project"
                                                                  ("Meetings"))
                                       :clock-in :clock-resume
                                       :empty-lines: 1))))
#+end_src
** Zettelkasten methodology

The zettelkasten methodology  offers a set of rules to help you to organize your notes in a
way that makes them easy to find. It is based on the idea of establishing links
between atomic concepts (each note). On this way, breaks the traditional
hierarchical structure based on folders and makes it easier to relate concepts

There are 4 kind of notes:
***  1. Fleeting notes

Fleeting notes are thinkings, ideas, concepts and sketch of future notes. They
need to be processed and related with another notes. To make it simple, the
name of this  notes has a prefix with the current date and time, so can be many
notes with the same "title". This method make easy not be distracted by the
title instead of the concept.

#+begin_src emacs-lisp
    (add-to-list 'org-roam-capture-templates
                 '("f" "Fleeting" plain "%?"
                  :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+TITLE: ${title}\n#+DATE: %U\n#+AUTHOR: %n\n#+filetags: fleeting")
             :unnarrowed nil))
#+end_src


***  2. Literature Notes

Literature notes are notes extracted from external source. These must include
the reference. These notes have summary or/and highlight from the source, and if
it is possible, tray to indicate:

1. Why this content is relevant?
2. When you read the source?
3. In which content do you think it can be useful?

To answer this question, you can use meta-data as header from of the note, a
link to the project/area which you think that can be useful and a link to
another note with the explanation. This allows you to keep separate the original
content to your conclusion and ideas.

#+begin_src emacs-lisp
  (setq bibliography-files '("~/Documents/Org/bibliography.bib"
                               "~/Documents/Org/phd.bib"))
;;   (after! ivy-bibtex
;;     (setq bibtex-completion-bibliography bibliography-files))


  (use-package! org-ref
    :init (require 'bibtex)
    :config (setq bibtex-autokey-year-length 4
                  bibtex-autokey-name-year-separator "-"
                  bibtex-autokey-year-title-separator "-"
                  bibtex-autokey-titleword-separator "-"
                  bibtex-autokey-titlewords 2
                  bibtex-autokey-titlewords-stretch 1
                  bibtex-autokey-titleword-length 5
                  org-ref-glsentries '("~/Documents/Org/roam/glossary.tex"))
    (define-key bibtex-mode-map (kbd "H-b") 'org-ref-bibtex-hydra/body)
    (define-key org-mode-map (kbd "C-c ]") 'org-ref-insert-link)
    (define-key org-mode-map (kbd "s-[") 'org-ref-insert-link-hydra/body)
    (require 'org-ref-ivy)
    (require 'org-ref-sci-id)
    (require 'org-ref-arxiv)
    (require 'org-ref-scopus)
    (require 'org-ref-pubmed)
    (require 'org-ref-wos)
    )


  (use-package! org-ref-ivy
    :init (setq org-ref-insert-link-function 'org-ref-insert-link-hydra/body
                org-ref-insert-cite-function 'org-ref-cite-insert-ivy
                org-ref-insert-label-function 'org-ref-insert-label-link
                org-ref-insert-ref-function 'org-ref-insert-ref-link
                org-ref-cite-onclick-function (lambda (_)
                  (org-ref-citation-hydra/body))))
#+end_src
*** Citar

[[https://github.com/emacs-citar/citar][Citar]] provides a highly-configurable completing-read front-end to browse and act
on BibTeX, BibLaTeX, and CSL JSON bibliographic data, and LaTeX, markdown, and
org-cite editing support.

#+begin_src emacs-lisp
  (use-package! citar
    :custom
    (citar-bibliography bibliography-files))
#+end_src
