config/doom2/config.org
*** citar-org-roam

This package use citar as base to improve the citation process.

#+begin_src emacs-lisp
  (use-package! org-roam-bibtex
    :after org-roam)
  (use-package! citar-org-roam
   :after citar-org-roam
   :config
   (citar-org-roam-mode)
   (citar-register-notes-source 'orb-citar-source
    (list :name "Org-Roam Notes"
     :category 'org-roam-node
     :items #'citar-org-roam--get-candidates
     :hasitems #'citar-org-roam-has-notes
     :open #'citar-org-roam-open-note
     :create #'orb-citar-edit-note
     :annotate #'citar-org-roam--annotate))
   (setq citar-notes-source 'orb-citar-source))
#+end_src


#+begin_src emacs-lisp
  (setq citar-org-roam-note-title-template "${author} - ${title}")
  (add-to-list 'org-roam-capture-templates
               '("r" "bibliography reference" plain "%?"
                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                    "#+TITLE: ${title}\n#+AUTHOR: ${author}\n#+filetags: Literature\n#+cite-key: ${citekey}\n#+cite-date: ${date} \n#+created: %U\n\n* ${title}\n\n**Abstract\n${abstract}")
                 :unnarrowed t))
  (setq citar-org-roam-capture-template-key "r")
#+end_src
*** Import annotations from Zotero

#+begin_src emacs-lisp
  (defun lem/import-notes-from-zotero (citekey)
  (interactive "sCiteKey: ")
    (let* ((entry (bibtex-completion-get-entry citekey))
           (note (bibtex-completion-get-value "note" entry ""))
           (pandoc-command "pandoc --from latex --to org")
           result)
      (with-temp-buffer
        (shell-command (format "echo \"%s\" | %s" note pandoc-command)
                       (current-buffer))
        (setq result (buffer-substring-no-properties (point-min) (point-max))))
      (insert result)))
#+end_src

I need if I add a new acronym, this will not be added only on the top of the
current buffer, such happens with org-ref. I need the acronym or the glossary
entry will be added into the list with all the acronyms.

#+begin_src emacs-lisp
          (defun lem/add-acronym (label abbrv full)
              (interactive "sLabel: \nsAccronym: \nsFull text: ")
              (save-excursion
        (re-search-backward "#\\+latex_header" nil t)
        (forward-line)
        (when (not (looking-at "^$"))
            (beginning-of-line)
            (insert "\n")
            (forward-line -1))
          (insert (format "#+latex_header_extra: \\newacronym{%s}{%s}{%s}\n"
                          label abbrv full))
          (write-region
           (format
            "\\newacronym{%s}{%s}{%s}\n"
            label abbrv full)
  nil "~/Documents/Org/roam/glossary2.tex" 'append)))

#+end_src
**  3. Permanent notes

Permanent notes are stand-alone ideas, that can be made without any direct
context to other sourced. Can be made as a recap or summary of the information,
but also can be thoughts that popped into your brain while you are working.

The aim of permanent notes is to process the notes you have made and extract
ideas, related content and any kind of useful information for you.


**  4. Index Notes

Index notes are these notes used to group connected notes. Can be a TOC, a sort
description, or whatever you want.
