config/doom2/config.el

(use-package! org-roam-bibtex
  :after org-roam)
(use-package! citar-org-roam
 :after citar-org-roam
 :config
 (citar-org-roam-mode)
 (citar-register-notes-source 'orb-citar-source
  (list :name "Org-Roam Notes"
   :category 'org-roam-node
   :items #'citar-org-roam--get-candidates
   :hasitems #'citar-org-roam-has-notes
   :open #'citar-org-roam-open-note
   :create #'orb-citar-edit-note
   :annotate #'citar-org-roam--annotate))
 (setq citar-notes-source 'orb-citar-source))

(setq citar-org-roam-note-title-template "${author} - ${title}")
(add-to-list 'org-roam-capture-templates
             '("r" "bibliography reference" plain "%?"
               :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                  "#+TITLE: ${title}\n#+AUTHOR: ${author}\n#+filetags: Literature\n#+cite-key: ${citekey}\n#+cite-date: ${date} \n#+created: %U\n\n* ${title}\n\n**Abstract\n${abstract}")
               :unnarrowed t))
(setq citar-org-roam-capture-template-key "r")

(defun lem/import-notes-from-zotero (citekey)
(interactive "sCiteKey: ")
  (let* ((entry (bibtex-completion-get-entry citekey))
         (note (bibtex-completion-get-value "note" entry ""))
         (pandoc-command "pandoc --from latex --to org")
         result)
    (with-temp-buffer
      (shell-command (format "echo \"%s\" | %s" note pandoc-command)
                     (current-buffer))
      (setq result (buffer-substring-no-properties (point-min) (point-max))))
    (insert result)))

(defun lem/add-acronym (label abbrv full)
            (interactive "sLabel: \nsAccronym: \nsFull text: ")
            (save-excursion
      (re-search-backward "#\\+latex_header" nil t)
      (forward-line)
      (when (not (looking-at "^$"))
          (beginning-of-line)
          (insert "\n")
          (forward-line -1))
        (insert (format "#+latex_header_extra: \\newacronym{%s}{%s}{%s}\n"
                        label abbrv full))
        (write-region
         (format
          "\\newacronym{%s}{%s}{%s}\n"
          label abbrv full)
nil "~/Documents/Org/roam/glossary2.tex" 'append)))
